# IsValidFaceId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BRepBuilder..::..IsValidFaceId Method
BRepBuilder Class See Also
---
A validator function that checks whether the face id corresponds to a face previously added to this BRepBuilder object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsValidFaceId(
	BRepBuilderGeometryId faceId
)
```

Visual Basic
---
```text
Public Function IsValidFaceId ( _
	faceId As BRepBuilderGeometryId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidFaceId(
	BRepBuilderGeometryId^ faceId
)
```

# ### Parameters
faceId
    Type: Autodesk.Revit.DB..::..BRepBuilderGeometryId Face id to be validated.
# ### Return Value
True if faceId corresponds to a face previously added to this BRepBuilder, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
BRepBuilder Class
Autodesk.Revit.DB Namespace